---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Diameter
zh: 直径、管径
source: html/9db212e7-a725-7095-9612-59dfe0e9d92a.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Diameter Property

**中文**: 直径、管径

The connector diameter, Units:(ft).

## Syntax (C#)
```csharp
public double Diameter { get; }
```